examples/guide/ruby/server/app/controllers/hotels_controller.rb

INSERT INTO "hotels" ("name", "city", "room_count", "updated_at", "rate", "created_at") VALUES('Caelum Objects Hotel', 'Sao Paulo', 3, '2009-12-13 22:44:09', 4, '2009-12-13 22:44:09')
---
  def create
    @hotel = parse_request_content
    raise Restfulie::Server::HTTP::BadRequest unless @hotel.kind_of? Hotel
    @hotel.save!

SELECT * FROM "hotels"
---
  def index
    @hotels = Hotel.all