examples/order/server/app/controllers/orders_controller.rb

  def index
    @orders = Order.all
---
SELECT * FROM "orders"