examples/order/server/app/controllers/payments_controller.rb

SELECT * FROM "orders" WHERE ("orders"."id" = 11)
UPDATE "orders" SET "updated_at" = '2010-02-09 16:10:42', "status" = 'preparing' WHERE "id" = 374
---
  def create

    type = model_type
    return head(415) unless fits_content(type, request.headers['CONTENT_TYPE'])

    # TODO could be Order.build_payment... do it automatically
    @model = type.from_xml request.body.string
    @model.order = Order.find(params[:order_id])
    # debugger
    if @model.order.status != "unpaid"
      head 405
    elsif @model.amount != @model.order.cost
      head :bad_request
    else
      @model.order.status = "preparing"
      if @model.save && @model.order.save

SELECT * FROM "orders" WHERE ("orders"."id" = 12)
---
  def show
    order = Order.find(params[:order_id])

SELECT * FROM "orders" WHERE ("orders"."id" = 43)
---
  def receipt
    order = Order.find(params[:order_id])